program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.2"}, {"coremlc-version", "1429.0.0"}})]
{
    func main<ios15>(tensor<fp32, [?, 224, 224, 3]> resnet50_input) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>>((("DefaultShapes", {{"resnet50_input", [1, 224, 224, 3]}})))] {
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [4]> transpose_161_perm_0 = const()[name = tensor<string, []>("transpose_161_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> resnet50_input_to_fp16_dtype_0 = const()[name = tensor<string, []>("resnet50_input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<int32, [8]> pad_2_pad_0 = const()[name = tensor<string, []>("pad_2_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 3, 3, 3, 3])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [?, 224, 224, 3]> cast_181 = cast(dtype = resnet50_input_to_fp16_dtype_0, x = resnet50_input);
            tensor<fp16, [?, 3, 224, 224]> transpose_164 = transpose(perm = transpose_161_perm_0, x = cast_181);
            tensor<fp16, [?, 3, 230, 230]> pad_2_cast = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_2_pad_0, x = transpose_164);
            tensor<string, []> sequential_resnet50_conv1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> sequential_resnet50_conv1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 3, 7, 7]> sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 3, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18944)))];
            tensor<fp16, [?, 64, 112, 112]> sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_2_cast);
            tensor<fp16, [?, 64, 112, 112]> sequential_resnet50_conv1_relu_Relu_cast = relu(x = sequential_resnet50_conv1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> const_3 = const()[name = tensor<string, []>("const_3"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [?, 64, 114, 114]> pad_1_cast = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = const_3, x = sequential_resnet50_conv1_relu_Relu_cast);
            tensor<int32, [2]> max_pool_0_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_0_kernel_sizes_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [2]> max_pool_0_strides_0 = const()[name = tensor<string, []>("max_pool_0_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> max_pool_0_pad_type_0 = const()[name = tensor<string, []>("max_pool_0_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> max_pool_0_pad_0 = const()[name = tensor<string, []>("max_pool_0_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_0_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_0_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 64, 56, 56]> max_pool_0_cast = max_pool(ceil_mode = max_pool_0_ceil_mode_0, kernel_sizes = max_pool_0_kernel_sizes_0, pad = max_pool_0_pad_0, pad_type = max_pool_0_pad_type_0, strides = max_pool_0_strides_0, x = pad_1_cast);
            tensor<string, []> sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_0_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_0_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block1_0_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19136)))];
            tensor<fp16, [256]> sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51968)))];
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block1_0_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block1_0_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block1_0_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block1_0_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = max_pool_0_cast);
            tensor<string, []> sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block1_1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 1, 1]> sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52544)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60800)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block1_1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block1_1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block1_1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block1_1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = max_pool_0_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block1_1_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block1_1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_2_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_2_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block1_2_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 3, 3]> sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60992)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134784)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block1_2_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block1_2_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block1_2_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block1_2_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block1_1_relu_Relu_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block1_2_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block1_2_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_3_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block1_3_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block1_3_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134976)))];
            tensor<fp16, [256]> sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(167808)))];
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block1_3_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block1_3_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block1_3_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block1_3_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block1_2_relu_Relu_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block1_add_add_cast = add(x = sequential_resnet50_conv2_block1_0_bn_FusedBatchNormV3_nchw_cast, y = sequential_resnet50_conv2_block1_3_bn_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block1_out_Relu_cast = relu(x = sequential_resnet50_conv2_block1_add_add_cast);
            tensor<string, []> sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block2_1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 256, 1, 1]> sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(168384)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201216)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block2_1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block2_1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block2_1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block2_1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block1_out_Relu_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block2_1_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block2_1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_2_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_2_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block2_2_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 3, 3]> sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201408)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(275200)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block2_2_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block2_2_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block2_2_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block2_2_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block2_1_relu_Relu_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block2_2_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block2_2_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_3_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block2_3_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block2_3_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(275392)))];
            tensor<fp16, [256]> sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308224)))];
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block2_3_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block2_3_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block2_3_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block2_3_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block2_2_relu_Relu_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block2_add_add_cast = add(x = sequential_resnet50_conv2_block1_out_Relu_cast, y = sequential_resnet50_conv2_block2_3_bn_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block2_out_Relu_cast = relu(x = sequential_resnet50_conv2_block2_add_add_cast);
            tensor<string, []> sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block3_1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 256, 1, 1]> sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308800)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(341632)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block3_1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block3_1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block3_1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block3_1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block2_out_Relu_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block3_1_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block3_1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_2_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_2_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block3_2_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 3, 3]> sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(341824)))];
            tensor<fp16, [64]> sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(415616)))];
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block3_2_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block3_2_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block3_2_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block3_2_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block3_1_relu_Relu_cast);
            tensor<fp16, [?, 64, 56, 56]> sequential_resnet50_conv2_block3_2_relu_Relu_cast = relu(x = sequential_resnet50_conv2_block3_2_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_3_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv2_block3_3_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv2_block3_3_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(415808)))];
            tensor<fp16, [256]> sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448640)))];
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv2_block3_3_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv2_block3_3_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv2_block3_3_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv2_block3_3_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block3_2_relu_Relu_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block3_add_add_cast = add(x = sequential_resnet50_conv2_block2_out_Relu_cast, y = sequential_resnet50_conv2_block3_3_bn_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [?, 256, 56, 56]> sequential_resnet50_conv2_block3_out_Relu_cast = relu(x = sequential_resnet50_conv2_block3_add_add_cast);
            tensor<string, []> sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_0_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_0_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block1_0_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 256, 1, 1]> sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [512, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(449216)))];
            tensor<fp16, [512]> sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(711424)))];
            tensor<fp16, [?, 512, 28, 28]> sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block1_0_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block1_0_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block1_0_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block1_0_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block3_out_Relu_cast);
            tensor<string, []> sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block1_1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 256, 1, 1]> sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(712512)))];
            tensor<fp16, [128]> sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(778112)))];
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block1_1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block1_1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block1_1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block1_1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv2_block3_out_Relu_cast);
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block1_1_relu_Relu_cast = relu(x = sequential_resnet50_conv3_block1_1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_2_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_2_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block1_2_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 3, 3]> sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(778432)))];
            tensor<fp16, [128]> sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1073408)))];
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block1_2_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block1_2_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block1_2_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block1_2_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv3_block1_1_relu_Relu_cast);
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block1_2_relu_Relu_cast = relu(x = sequential_resnet50_conv3_block1_2_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_3_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv3_block1_3_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block1_3_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 128, 1, 1]> sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [512, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1073728)))];
            tensor<fp16, [512]> sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1204864)))];
            tensor<fp16, [?, 512, 28, 28]> sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block1_3_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block1_3_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block1_3_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block1_3_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv3_block1_2_relu_Relu_cast);
            tensor<fp16, [?, 512, 28, 28]> sequential_resnet50_conv3_block1_add_add_cast = add(x = sequential_resnet50_conv3_block1_0_bn_FusedBatchNormV3_nchw_cast, y = sequential_resnet50_conv3_block1_3_bn_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [?, 512, 28, 28]> sequential_resnet50_conv3_block1_out_Relu_cast = relu(x = sequential_resnet50_conv3_block1_add_add_cast);
            tensor<string, []> sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_1_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_1_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block2_1_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 512, 1, 1]> sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [128, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1205952)))];
            tensor<fp16, [128]> sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1337088)))];
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block2_1_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block2_1_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block2_1_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block2_1_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv3_block1_out_Relu_cast);
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block2_1_relu_Relu_cast = relu(x = sequential_resnet50_conv3_block2_1_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_2_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_2_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block2_2_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 3, 3]> sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1337408)))];
            tensor<fp16, [128]> sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1632384)))];
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_cast = conv(bias = sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = sequential_resnet50_conv3_block2_2_conv_Conv2Dx_dilations_0, groups = sequential_resnet50_conv3_block2_2_conv_Conv2Dx_groups_0, pad = sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_0, pad_type = sequential_resnet50_conv3_block2_2_conv_Conv2Dx_pad_type_0, strides = sequential_resnet50_conv3_block2_2_conv_Conv2Dx_strides_0, weight = sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_weight_0_to_fp16, x = sequential_resnet50_conv3_block2_1_relu_Relu_cast);
            tensor<fp16, [?, 128, 28, 28]> sequential_resnet50_conv3_block2_2_relu_Relu_cast = relu(x = sequential_resnet50_conv3_block2_2_bn_FusedBatchNormV3_nchw_cast);
            tensor<string, []> sequential_resnet50_conv3_block2_3_conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_3_conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_3_conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_3_conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> sequential_resnet50_conv3_block2_3_conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_3_conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> sequential_resnet50_conv3_block2_3_conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("sequential_resnet50_conv3_block2_3_conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
